Repository: LittleFish-233/EncryptionAssistant
Catalog: EncryptionAssistant/String/*/shiyong.resw
Source language: en_us
Languages: de, fr, ja_jp, zh_cn, zh_hant

# textblock1.Text
source: Key
de: schlüssel
fr: clé
ja_jp: キー
zh_cn: 密匙
zh_hant: 密匙

# textblock10.Text
source: DES (Data Standard Encryption): Symmetry algorithm, data encryption standard, faster, suitable for encrypting large amounts of data;
de: DES (Data Standard Encryption): Symmetriealgorithmus, Datenverschlüsselungsstandard, schneller, geeignet für die Verschlüsselung großer Datenmengen;
fr: DES (Data Standard Encryption): algorithme de symétrie, norme de cryptage des données, plus rapide, adapté pour le cryptage de grandes quantités de données;
ja_jp: DES (データ標準暗号化): 対称アルゴリズム、データ暗号化標準、高速化、大量のデータの暗号化に適しています。
zh_cn: DES（Data Encryption Standard）：对称算法，数据加密标准，速度较快，适用于加密大量数据的场合；
zh_hant: DES（Data Encryption Standard）：對稱演算法，資料加密標準，速度較快，適用于加密大量資料的場合；

# textblock11.Text
source: DES (Data Standard Encryption): Symmetry algorithm, data encryption standard, faster, suitable for encrypting large amounts of data; ...
de: 3DES (Triple DES): Ein symmetrischer Algorithmus, der auf DES basiert und ein Datenstück dreimal mit drei verschiedenen Schlüsseln verschlüsselt, mit einer höheren Intensität;
fr: 3DES (Triple DES) : Algorithme symétrique basé sur DES, qui crypte un morceau de données trois fois avec trois touches différentes, avec une intensité plus élevée ;
ja_jp: 3DES (トリプル DES): DES に基づく対称アルゴリズムで、3 つの異なるキーでデータを 3 回暗号化し、より高い強度を持つ。
zh_cn: 3DES（Triple DES）：是基于DES的对称算法，对一块数据用三个不同的密钥进行三次加密，强度更高；
zh_hant: 3DES（Triple DES）：是基於DES的對稱演算法，對一塊資料用三個不同的金鑰進行三次加密，強度更高；

# textblock12.Text
source: RC2 and RC4: Symmetry algorithm, which encrypts large amounts of data with a long key, faster than DES;
de: RC2 und RC4: Symmetriealgorithmus, der große Datenmengen mit einem langen Schlüssel verschlüsselt, schneller als DES;
fr: RC2 et RC4: Algorithme de symétrie, qui crypte de grandes quantités de données avec une longue clé, plus rapide que DES;
ja_jp: RC2 と RC4: 対称アルゴリズムは、DES よりも高速な長いキーで大量のデータを暗号化します。
zh_cn: RC2和RC4：对称算法，用变长密钥对大量数据进行加密，比 DES 快；
zh_hant: RC2和RC4：對稱演算法，用變長金鑰組大量資料進行加密，比 DES 快；

# textblock13.Text
source: Advanced Encryption: Advanced encryption standard, symmetric algorithm, is the next generation of encryption algorithm standard, fast, high security level, in the 21st century AES standard one implementation is the Rijndael algorithm;
de: Erweiterte Verschlüsselung: Erweiterter Verschlüsselungsstandard, symmetrischer Algorithmus, ist die nächste Generation von Verschlüsselungsalgorithmus Standard, schnell, hohe Sicherheitsstufe, in der 21. Jahrhundert AES-Standard eine Implementierung ist der Rijndael-Algorithmus;
fr: Chiffrement avancé : La norme de chiffrement avancée, algorithme symétrique, est la prochaine génération d'algorithme de cryptage standard, rapide, niveau de sécurité élevé, dans le 21ème siècle AES standard une implémentation est l'algorithme Rijndael;
ja_jp: AES（Advanced Encryption Standard）：高级加密标准，对称算法，是下一代的加密算法标准，速度快，安全级别高，在21世纪AES 标准的一个实现是 Rijndael 算法；
zh_cn: AES（Advanced Encryption Standard）：高级加密标准，对称算法，是下一代的加密算法标准，速度快，安全级别高，在21世纪AES 标准的一个实现是 Rijndael 算法；
zh_hant: AES（Advanced Encryption Standard）：進階加密標準，對稱演算法，是下一代的加密演算法標準，速度快，安全級別高，在21世紀AES 標準的一個實現是 Rijndael 演算法；

# textblock14.Text
source: Note: It is recommended to use AES 192 bits for encryption, which is safe and efficient. Due to technical restrictions on the full use of the Electronic Cipher Book (ECB) mode, which may degrade security performance, confidential files are used using Win32's encryption software. Stay tuned for follow-up updates.
de: Hinweis: Es wird empfohlen, AES 192 Bits für die Verschlüsselung zu verwenden, die sicher und effizient ist. Aufgrund technischer Einschränkungen bei der vollständigen Nutzung des elektronischen Verschlüsselungsbuchs (ECB), die die Sicherheitsleistung beeinträchtigen können, werden vertrauliche Dateien mit der Verschlüsselungssoftware von Win32 verwendet. Bleiben Sie dran für Follow-up-Updates。
fr: Remarque : Il est recommandé d'utiliser 192 bits AES pour le chiffrement, qui est sûr et efficace. En raison des restrictions techniques sur l'utilisation complète du mode Electronic Cipher Book (ECB), qui peut dégrader les performances de sécurité, des fichiers confidentiels sont utilisés à l'aide du logiciel de cryptage de Win32. Restez à l'écoute pour les mises à jour de suivi.
ja_jp: 注: 安全で効率的な暗号化には AES 192 ビットを使用することをお勧めします。 セキュリティパフォーマンスを低下させる可能性のある電子暗号ブック (ECB) モードの完全な使用に技術的な制限があるため、機密ファイルは Win32 の暗号化ソフトウェアを使用して使用されます。 フォローアップの更新にご期待ください。
zh_cn: 注意：推荐使用AES 192位进行加密，安全高效。由于技术限制全部使用电子密码本（ECB）模式，可能会降低安全性能，机密文件请使用Win32的加密软件。敬请期待后续更新。
zh_hant: 注意：推薦使用AES 192位進行加密，安全高效。 由於技術限制全部使用電子密碼本（ECB）模式，可能會降低安全性能，機密檔請使用Win32的加密軟體。 敬請期待後續更新。

# textblock15.Text
source: password
de: Kennwort
fr: mot de passe
ja_jp: パスワード
zh_cn: 密码
zh_hant: 密碼

# textblock16.Text
source: Concept: The password here does not affect the overall encryption of the file, that is, no matter what the password is, the encrypted file is essentially the same. So the password is only inside this app as a function of identity verification and cannot protect the file, to protect the file please modify the key。
de: Konzept: Das Passwort hat hier keinen Einfluss auf die Gesamtverschlüsselung der Datei, d.h. unabhängig vom Passwort ist die verschlüsselte Datei im Wesentlichen gleich. So ist das Passwort nur innerhalb dieser App als Funktion der Identitätsüberprüfung und kann die Datei nicht schützen, um die Datei zu schützen, ändern Sie bitte den Schlüssel。
fr: Concept: Le mot de passe ici n'affecte pas le chiffrement global du fichier, c'est-à-dire, peu importe ce que le mot de passe est, le fichier crypté est essentiellement le même. Ainsi, le mot de passe est seulement à l'intérieur de cette application en fonction de la vérification d'identité et ne peut pas protéger le fichier, pour protéger le fichier s'il vous plaît modifier la clé。
ja_jp: 概念: ここでのパスワードは、ファイルの全体的な暗号化には影響しません。 だから、パスワードは、アイデンティティ検証の機能としてアプリ内にあり、ファイルを保護することはできません、ファイルを保護するために、キーを変更してください。
zh_cn: 概念：这里的密码并不会影响文件整体的加密情况，也就是说无论密码是什么，加密后的文件本质都是一样的。因此密码只在这个应用内部作为验证身份的功能而不能保护文件，要想保护文件请修改密匙。
zh_hant: 概念：這裡的密碼並不會影響檔整體的加密情況，也就是說無論密碼是什麼，加密後的檔本質都是一樣的。 因此密碼只在這個應用內部作為驗證身份的功能而不能保護檔，要想保護檔請修改密匙。

# textblock17.Text
source: Concept: The password here does not affect the overall encryption of the file, that is, no matter what the password is, the encrypted file is essentially the same. So the password is only inside this app as a function of identity verification and cannot protect the file, to protect the file please modify the key ...
de: Passwort festlegen: (1) Geben Sie das Passwort ein (2) klicken Sie auf (3) Geben Sie das Kennwort erneut ein (4) Stand-alone-Bestätigung (5) Stellen Sie den Kennwortfehler ein, nachdem der Eingabeaufforderungskennwortfehler erneut eingegeben werden kann, prompt dreimal kann das Kennwort zurückgesetzt werden, achten Sie darauf, das Passwort-Eingabefeld über dem Text zu beachten
fr: Définir le mot de passe: (1) Entrez le mot de passe (2) cliquez (3) Entrez le mot de passe à nouveau (4) confirmation autonome (5) définir l'erreur de mot de passe après l'erreur de mot de passe rapide peut être ré-entré, invitez trois fois peut réinitialer le mot de passe, prêter attention à observer la boîte d'entrée de mot de passe au-dessus du texte
ja_jp: パスワードを設定する:(1)パスワードを入力する(2)パスワードを再入力する(3)パスワードを再入力する(4)スタンドアロン確認(5)パスワードエラーを再入力した後にパスワードエラーを設定し、プロンプト3回パスワードをリセットすることができ、テキストの上のパスワード入力ボックスに注意してください
zh_cn: 设置密码：（1）输入密码（2）单击使用（3）再次输入密码（4）单机确认（5）设置成功（6）提示密码错误后可以重新输入，提示三次后可以重新设置密码，注意观察密码输入框上方文字
zh_hant: 設置密碼：（1）輸入密碼（2）按一下使用（3）再次輸入密碼（4）單機確認（5）設置成功（6）提示密碼錯誤後可以重新輸入，提示三次後可以重新設置密碼，注意觀察密碼輸入框上方文字

# textblock18.Text
source: Note: Passwords are stored with the same encryption algorithm and key encryption, meaning that a password error may be a decryption algorithm or a key error. There is no limit to the length of the password, and you can't enter it.
de: Hinweis: Kennwörter werden mit demselben Verschlüsselungsalgorithmus und der gleichen Schlüsselverschlüsselung gespeichert, was bedeutet, dass ein Kennwortfehler ein Entschlüsselungsalgorithmus oder ein Schlüsselfehler sein kann. Es gibt keine Begrenzung für die Länge des Kennworts, und Sie können es nicht eingeben.
fr: Remarque : Les mots de passe sont stockés avec le même algorithme de cryptage et le même chiffrement de clé, ce qui signifie qu'une erreur de mot de passe peut être un algorithme de décryptage ou une erreur de clé. Il n'y a pas de limite à la longueur du mot de passe, et vous ne pouvez pas l'entrer.
ja_jp: 注: パスワードは同じ暗号化アルゴリズムとキー暗号化で格納されるため、パスワード エラーは復号化アルゴリズムまたはキー エラーである可能性があります。 パスワードの長さに制限はなく、入力できません。
zh_cn: 注意：存储密码时会使用一样的加密算法和密匙加密，也就是说提示密码错误的时候可能是 解密算法或解密密匙错误。密码长度没有限制，也可以不输入。
zh_hant: 設置密碼：（1）輸入密碼（2）按一下使用（3）再次輸入密碼（4）單機確認（5）設置成功（6）提示密碼錯誤後可以重新輸入，提示三次後可以重新設置密碼，注意觀察密碼輸入框上方文字 ...

# textblock19.Text
source: Secret format
de: Geheimes Format
fr: Format secret
ja_jp: シークレット形式
zh_cn: 密文格式
zh_hant: 密文格式

# textblock2.Text
source: Concept: A key is a password that belongs to an encryption algorithm, and others must enter the key and use a matching decryption algorithm to decrypt the file. Because the key is part of the encryption algorithm, which encryption algorithm is used determines the maximum length of the key
de: Konzept: Ein Schlüssel ist ein Kennwort, das zu einem Verschlüsselungsalgorithmus gehört, und andere müssen den Schlüssel eingeben und einen übereinstimmenden Entschlüsselungsalgorithmus verwenden, um die Datei zu entschlüsseln. Da der Schlüssel Teil des Verschlüsselungsalgorithmus ist, bestimmt der verwendete Verschlüsselungsalgorithmus die maximale Länge des Schlüssels.
fr: Concept : Une clé est un mot de passe qui appartient à un algorithme de cryptage, et d'autres doivent entrer la clé et utiliser un algorithme de décryptage correspondant pour déchiffrer le fichier. Parce que la clé fait partie de l'algorithme de cryptage, l'algorithme de chiffrement utilisé détermine la longueur maximale de la clé
ja_jp: 概念: キーは暗号化アルゴリズムに属するパスワードであり、他のキーを入力し、一致する復号化アルゴリズムを使用してファイルを復号化する必要があります。 キーは暗号化アルゴリズムの一部であるため、どの暗号化アルゴリズムを使用して、キーの最大長が決定されます。
zh_cn: 概念：密匙就是属于加密算法的一个密码，其他人必须通过输入这个密匙并使用匹配的解密算法才能解密文件。因为密匙是加密算法的一部分，所以采用何种加密算法决定了密匙的最大长度
zh_hant: 概念：密匙就是屬於加密演算法的一個密碼，其他人必須通過輸入這個密匙並使用匹配的解密演算法才能解密檔。 因為密匙是加密演算法的一部分，所以採用何種加密演算法決定了密匙的最大長度

# textblock20.Text
source: The encrypted text is encrypted with a #的开头 similar to the #1A2, making sure that all copies are copied, that no one character is decrypted, and that its detailed construction is not discussed for security reasons.
de: Der verschlüsselte Text wird mit einem #的开头 ähnlich dem #1A2 verschlüsselt, wobei sichergestellt wird, dass alle Kopien kopiert werden, dass kein Zeichen entschlüsselt wird und dass seine detaillierte Konstruktion aus Sicherheitsgründen nicht besprochen wird.
fr: Le texte crypté est crypté avec un #的开头 similaire à la #1A2, en s'assurant que toutes les copies sont copiées, qu'aucun personnage n'est décrypté et que sa construction détaillée n'est pas discutée pour des raisons de sécurité.
ja_jp: 暗号化されたテキストは、#1A2に似た#的开头で暗号化され、すべてのコピーがコピーされ、1 文字が復号化されていない、およびセキュリティ上の理由から詳細な構築が議論されないようにします。
zh_cn: 加密文本后的密文会以类似于##1A2##的开头，请确保全部复制，少了任何一个字符都无法解密，出于安全考虑不讨论其详细的构造。
zh_hant: 加密文本後的密文會以類似于##1A2##的開頭，請確保全部複製，少了任何一個字元都無法解密，出於安全考慮不討論其詳細的構造。

# textblock21.Text
source: Other instructions on encryption
de: Weitere Anweisungen zur Verschlüsselung
fr: Autres instructions sur le chiffrement
ja_jp: 暗号化に関するその他の手順
zh_cn: 其他关于加密的说明
zh_hant: 其他關於加密的說明

# textblock22.Text
source: 1. The size of the files that can be encrypted depends on your computer memory size and architecture, 32-bit operating system can be encrypted up to 400MB, 64-bit operating system can encrypt more than 1GB; Because the performance of each device is different, we do not set the file size limit, in order to decrypt normally Do not encrypt files at critical value size (test machine performance: Intel (R)Core (TM)) I5-5200U CPU 2.20GHz 2.20GHz, RAM 8GB, Windows 10 (x64) Pro 17763.253)
de: 1. Die Größe der Dateien, die verschlüsselt werden können, hängt von der Speichergröße und Architektur Ihres Computers ab, 32-Bit-Betriebssystem kann bis zu 400MB verschlüsselt werden, 64-Bit-Betriebssystem kann mehr als 1 GB verschlüsseln; Da die Leistung jedes Geräts unterschiedlich ist, legen wir die Dateigrößenbeschränkung nicht fest, um Dateien normalerweise nicht mit kritischer Wertgröße zu verschlüsseln (Testmaschinenleistung: Intel (R)Core (TM)) I5-5200U CPU 2.20GHz 2.20GHz, RAM 8GB, Windows 10 (x64) Pro 17763.253)
fr: 1. La taille des fichiers qui peuvent être cryptés dépend de la taille de votre mémoire d'ordinateur et de l'architecture, le système d'exploitation 32 bits peut être crypté jusqu'à 400 Mo, 64 bits système d'exploitation peut crypter plus de 1 Go; Parce que les performances de chaque appareil est différente, nous ne marquons pas la limite de taille des fichiers, afin de déchiffrer normalement Ne pas chiffrer les fichiers à la taille de la valeur critique (performance de la machine de test: Intel (R)Core (TM)) I5-5200U CPU 2.20GHz 2.20GHz, RAM 8GB, Windows 10 (x64) Pro 17763.253)
ja_jp: 1.暗号化できるファイルのサイズは、コンピュータのメモリサイズとアーキテクチャによって異なりますが、32ビットオペレーティングシステムは最大400MBまで暗号化することができ、64ビットオペレーティングシステムは1GB以上を暗号化できます。 各デバイスのパフォーマンスが異なるため、ファイルサイズの制限を設定しませんが、通常は重要な値サイズでファイルを暗号化しないでください(テストマシンのパフォーマンス:インテル(R)Core(TM))I5-5200U CPU 2.20GHz 2.20GHz、RAM 8GB、 Windows 10 (x64) プロ 17763.253
zh_cn: 1.可以加密的文件大小取决于你的计算机内存大小和体系架构，32位操作系统最高可加密400MB，64位操作系统可加密1GB以上；加密时所需内存大致是文件大小的3倍,如果文件太大会直接卡死，解决办法是强行重启；由于每台设备的性能不一样，我们并没有设置文件大小上限；为了正常解密请不要加密处于临界值大小的文件（测试机器性能：Intel(R)Core(TM)i5-5200U CPU@ 2.20GHz2.20GHz,RAM 8GB,Windows 10(x64)专业版 17763.253）
zh_hant: 1.可以加密的檔案大小取決於你的電腦記憶體大小和體系架構，32位作業系統最高可加密400MB，64位作業系統可加密1GB以上；加密時所需記憶體大致是檔案大小的3倍,如果檔太大會直接卡死，解決辦法是強行重啟 ；由於每台設備的性能不一樣，我們並沒有設置檔案大小上限；為了正常解密請不要加密處於臨界值大小的檔（測試機器性能：Intel(R)Core(TM)i5-5200U CPU@ 2.20GHz2.20GHz,RAM 8GB, Windows 10(x64)專業版 17763.253）

# textblock23.Text
source: 2. Remind the file to be encrypted: the encrypted file suffix will be modified to .lfjia, decrypted and returned to normal. Double-click decryption is under development
de: 2. Erinnern Sie die zu verschlüsselnde Datei: Das verschlüsselte Dateisuffix wird in .lfjia geändert, entschlüsselt und wieder normalisiert. Doppelklick-Entschlüsselung ist in der Entwicklung
fr: 2. Rappelez au fichier d'être crypté : le suffixe de fichier crypté sera modifié en .lfjia, décrypté et retourné à la normale. Le décryptage en double clic est en cours de développement
ja_jp: 2. 暗号化するファイルを思い出させる: 暗号化されたファイルサフィックスは .lfjia に変更され、復号化され、通常に戻されます。 ダブルクリック復号化は開発中です
zh_cn: 2.提醒文件被加密：加密后的文件后缀名会被修改为.lfjia ，解密后恢复正常。双击解密功能正在开发中
zh_hant: 2.提醒檔被加密：加密後的檔尾碼名會被修改為.lfjia ，解密後恢復正常。 按兩下解密功能正在開發中

# textblock24.Text
source: 3. Record encrypted information: the encryption file will record the encryption algorithm and key, decrypting although the input of the wrong algorithm or key, will also be normal decryption, but the password input error will abort decryption.
de: 3. Aufzeichnung verschlüsselter Informationen: Die Verschlüsselungsdatei wird den Verschlüsselungsalgorithmus und Schlüssel aufzeichnen, entschlüsseln, obwohl die Eingabe des falschen Algorithmus oder Schlüssel, wird auch normale Entschlüsselung sein, aber das Passwort Eingabefehler wird die Entschlüsselung abbrechen.
fr: 3. Enregistrer les informations chiffrées: le fichier de chiffrement enregistrera l'algorithme de cryptage et la clé, décryptage bien que l'entrée du mauvais algorithme ou clé, sera également décryptage normal, mais l'erreur d'entrée de mot de passe va interrompre le décryptage.
ja_jp: 3.暗号化された情報を記録する:暗号化ファイルは、間違ったアルゴリズムやキーの入力も通常の復号化になりますが、暗号化アルゴリズムとキーを記録しますが、パスワード入力エラーは復号化を中止します。
zh_cn: 3.记录加密信息：加密文件中会记录加密算法和密匙，解密时尽管输入的是错误的算法或密匙，也会正常解密，但是密码输入错误后会中止解密。
zh_hant: 3.記錄加密資訊：加密檔中會記錄加密演算法和密匙，解密時儘管輸入的是錯誤的演算法或密匙，也會正常解密，但是密碼輸入錯誤後會中止解密。

# textblock25.Text
source: 4. Delete the source file: the deleted file after checking will not appear in the recycle bin, please think twice before enabling
de: 4. Löschen Sie die Quelldatei: die gelöschte Datei nach der Überprüfung wird nicht im Papierkorb angezeigt, bitte denken Sie zweimal nach, bevor Sie die Aktivierung
fr: 4. Supprimer le fichier source: le fichier supprimé après vérification n'apparaîtra pas dans le bac de recyclage, s'il vous plaît réfléchir à deux fois avant de activer
ja_jp: 4.ソースファイルを削除する:チェック後に削除されたファイルは、ごみ箱に表示されません、有効にする前にもう一度考えてください
zh_cn: 4.删除源文件：勾选后删除的文件不会出现在回收站中，请三思后启用
zh_hant: 4.刪除原始檔案：勾選後刪除的檔不會出現在回收站中，請三思後啟用

# textblock26.Text
source: 5. Dual encryption: This feature is in response to a query (Jin Fan kingium.outlook.com). Version 1.4.12 has been extensively tested by developers and there is no case for replacing an encryption key or password. The introduction of this feature now rejects this possibility.
de: 5. Doppelte Verschlüsselung: Diese Funktion ist eine Antwort auf eine Abfrage (Jin Fan kingium.outlook.com). Version 1.4.12 wurde von Entwicklern ausgiebig getestet und es gibt keinen Grund, einen Verschlüsselungsschlüssel oder ein Passwort zu ersetzen. Die Einführung dieser Funktion lehnt diese Möglichkeit nun ab.
fr: 5. Double chiffrement : cette fonctionnalité est en réponse à une requête (Jin Fan kingium.outlook.com). La version 1.4.12 a été largement testée par les développeurs et il n'y a aucun cas pour remplacer une clé de chiffrement ou un mot de passe. L'introduction de cette fonctionnalité rejette maintenant cette possibilité.
ja_jp: 5.デュアル暗号化:この機能は、クエリ(jinファンkingium.outlook.com)に応答しています。 バージョン 1.4.12 は開発者によって広範囲にテストされており、暗号化キーやパスワードを置き換える場合はありません。 この機能の導入は、この可能性を拒否します。
zh_cn: 5.双重加密：此功能是为了回应（Jin Fan kingium@outlook.com）的质疑。1.4.12版本经过开发人员的大量测试，不存在替换加密密匙或密码的情况。现在引入这个功能更是否决了这个可能性。
zh_hant: 5.雙重加密：此功能是為了回應（Jin Fan kingium@outlook.com）的質疑。 1.4.12版本經過開發人員的大量測試，不存在替換加密密匙或密碼的情況。 現在引入這個功能更是否決了這個可能性。

# textblock27.Text
source: 6. This app calls UWP's own API, which is self-researching the encryption/decrypting C library
de: 6. Diese App ruft die eigene API der UWP auf, die die Verschlüsselung/Entschlüsselung der C-Bibliothek selbst recherchiert
fr: 6. Cette application appelle l'API d'UWP, qui fait des recherches sur la bibliothèque C de cryptage/décryptage
ja_jp: 6.このアプリは、暗号化/復号化Cライブラリを自己調査しているUWP独自のAPIを呼び出します
zh_cn: 6.此应用调用UWP自带API，正在自研加密/解密C++库
zh_hant: 6.此應用調用UWP自帶API，正在自研加密/解密C++庫

# textblock28.Text
source: 7. Bulk encrypted files will be discharged in the original folder order hierarchy, but the saved folder will be saved as the first layer by default
de: 6. Diese App ruft die eigene API der UWP auf, die die Verschlüsselung/Entschlüsselung der C-Bibliothek selbst recherchiert ...
fr: 7. Les fichiers chiffrés en vrac seront déchargés dans la hiérarchie d'ordre de dossier d'origine, mais le dossier enregistré sera enregistré comme la première couche par défaut
ja_jp: 7. 一括暗号化されたファイルは元のフォルダ順序階層で排出されますが、保存されたフォルダはデフォルトで最初のレイヤーとして保存されます。
zh_cn: 7.批量加密后的文件将会按照原文件夹顺序层次排放，但是会把保存到的文件夹默认作为第一层存放
zh_hant: 7.大量加密後的檔將會按照原資料夾順序層次排放，但是會把保存到的資料夾預設作為第一層存放

# textblock29.Text
source: MD5 and hash algorithms and contrasting text
de: 6. Diese App ruft UWP eigene API, ist Selbststudium Verschlüsselung / Entschlüsselung von C-Bibliothek 7. Bulk-verschlüsselte Dateien werden in der ursprünglichen Ordner-Reihenfolge Hierarchie freigegeben werden, aber wird den Ordner Standard als die erste Schicht von Speicher MD5 und Hash-Algorithmus und Kontrast-Text speichern
fr: Algorithmes MD5 et hachage et texte contrasté
ja_jp: MD5ハッシュアルゴリズムと対照的なテキスト
zh_cn: MD5和哈希算法以及对比文本
zh_hant: MD5和雜湊演算法以及對比文本

# textblock3.Text
source: Encryption/decryption keys: Using the default key encryption eliminates the need to enter the key yourself, but reduces some security. To prevent files from being maliciously decrypted by other apps, the default key is no longer explicitly displayed this time. Previously, due to our negligence, we are sorry that we did not take into account the malicious use of the default key attack by a technician. The number of digits required for each encryption algorithm is given, and in general dividing the number of digits by 8 is the length of the character you want to enter (we do not guarantee the consequences of Chinese) for example: 56 bits will be entered with 7 numbers or letters (for example: 123F56A) (to be exact hexadecimal, F after the letter as far as possible do not lose). If more or less than a given number of keys is detected, the app truncates from the back or uses empty characters to complement them.
de: Verschlüsselungs-/Entschlüsselungsschlüssel: Die Verwendung der Standardschlüsselverschlüsselung macht die Eingabe des Schlüssels nicht mehr selbst erforderlich, verringert jedoch die Sicherheit. Um zu verhindern, dass Dateien von anderen Apps böswillig entschlüsselt werden, wird der Standardschlüssel dieses Mal nicht mehr explizit angezeigt. Zuvor, aufgrund unserer Fahrlässigkeit, bedauern wir, dass wir die böswillige Verwendung des Standard-Schlüsselangriffs durch einen Techniker nicht berücksichtigt haben. Die Anzahl der für jeden Verschlüsselungsalgorithmus erforderlichen Ziffern ist angegeben, und im Allgemeinen ist die Division der Anzahl der Ziffern durch 8 die Länge des Zeichens, das Sie eingeben möchten (wir garantieren nicht die Folgen des Chinesischen) zum Beispiel: 56 Bits werden mit 7 Zahlen oder Buchstaben eingegeben (z. B. 123F56A) (um genau zu sein hexadezimal, F nach dem Buchstaben so weit wie möglich nicht verlieren). Wenn mehr oder weniger als eine bestimmte Anzahl von Schlüsseln erkannt wird, wird die App von hinten abgeschnitten oder verwendet leere Zeichen, um sie zu ergänzen.
fr: Clés de chiffrement/décryptage : l'utilisation du chiffrement de clé par défaut élimine la nécessité d'entrer la clé vous-même, mais réduit une certaine sécurité. Pour éviter que les fichiers ne soient décryptés de manière malveillante par d'autres applications, la clé par défaut n'est plus explicitement affichée cette fois. Auparavant, en raison de notre négligence, nous sommes désolés de ne pas avoir pris en compte l'utilisation malveillante de l'attaque clé par défaut par un technicien. Le nombre de chiffres requis pour chaque algorithme de cryptage est donné, et en général diviser le nombre de chiffres par 8 est la longueur du personnage que vous voulez entrer (nous ne garantissons pas les conséquences du chinois) par exemple: 56 bits seront entrés avec 7 numéros ou lettres (par exemple: 123F56A) (pour être exactement hexadecimal, F après la lettre dans la mesure du possible ne perdez pas). Si plus ou moins d'un nombre donné de touches est détectée, l'application tronque à l'arrière ou utilise des caractères vides pour les compléter.
ja_jp: 暗号化/復号化キー: 既定のキー暗号化を使用すると、キーを自分で入力する必要がなくなりますが、セキュリティが低下します。 ファイルが他のアプリによって悪意を持って復号化されないように、既定のキーは今度は明示的に表示されなくなります。 以前は、当社の過失により、技術者によるデフォルトのキー攻撃の悪意のある使用を考慮しなかったことを残念に思います。 各暗号化アルゴリズムに必要な桁数が与えられ、一般的に数字を8で割ると、入力する文字の長さ(中国語の結果を保証しません):56ビットは7つの数字または文字(例えば:123F56A)で入力されます(正確にはヘキサデフィマル、 Fは、可能な限り失うことはありません文字の後に)。 特定の数のキーが検出された場合、アプリは背面から切り捨てるか、空の文字を使用してキーを補完します。
zh_cn: 加密/解密密匙：使用默认密匙加密可以免去你自己输入密匙这个步骤，但是会降低一部分安全性。为了防止文件被其他应用恶意解密，这次不再明文显示默认密匙。从前由于我们的疏忽没有考虑到技术人员恶意使用默认密匙攻击，深感抱歉。每一种加密算法所需要的密匙的位数都会给出，一般情况下将位数除以8就是你要输入的字符长度（我们不担保用中文的后果）比如：56位就要输入7个数字或字母（再比如：123F56A）（准确来说是十六进制数，F以后的字母尽可能不要输）。如果检测到密匙位数多于或少于给定位数，应用会从后向前截断或使用空字符补齐。
zh_hant: 加密/解密密匙：使用預設密匙加密可以免去你自己輸入密匙這個步驟，但是會降低一部分安全性。 為了防止檔被其他應用惡意解密，這次不再明文顯示預設密匙。 從前由於我們的疏忽沒有考慮到技術人員惡意使用預設密匙攻擊，深感抱歉。 每一種加密演算法所需要的密匙的位數都會給出，一般情況下將位數除以8就是你要輸入的字元長度（我們不擔保用中文的後果）比如：56位就要輸入7個數字或字母（再比如：123F56A）（準確來說是十六進位數， F以後的字母盡可能不要輸）。 如果檢測到密匙位數多於或少於給定位數，應用會從後向前截斷或使用空字元補齊。
